cf/Catalogs/ПодарочныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПодарочныеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПодарочныеКарты_Номинал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПодарочныеКарты_Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоАктивации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаПришел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОткудаПришел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументАктивации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/ПодарочныеКарты_Статус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПодарочныеКарты_Статус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ПодарочныеКарты/Forms/ФормаСозданияНовыхКарт/Ext/Form/Module.bsl
&НаСервере
Процедура СоздатьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодарочныеКарты.Наименование
	               |ИЗ
	               |	Справочник.ПодарочныеКарты КАК ПодарочныеКарты
	               |ГДЕ
	               |	ПодарочныеКарты.Номинал = &Номинал
	               |	И ПодарочныеКарты.ПорядковыйНомер МЕЖДУ &НомерНачала И &НомерКонца";
	Запрос.УстановитьПараметр("Номинал",Номинал);
	Запрос.УстановитьПараметр("НомерНачала",НомерОт);
	Запрос.УстановитьПараметр("НомерКонца",НомерДо);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество()>0 Тогда
		Пока Результат.Следующий() Цикл
			Сообщить("Карта в диапазоне уже существует: "+Результат.Наименование);
		КонецЦикла;
		Сообщить("Создание новых карт невозможно, т.к. в данном диапазоне уже есть созданные карты");
		Возврат;
	КонецЕсли;
	
	Для п=НомерОт По НомерДо Цикл
		НовКарта = Справочники.ПодарочныеКарты.СоздатьЭлемент();
		НовКарта.Номинал = Номинал;
		НовКарта.ПорядковыйНомер = п;
		НовКарта.Наименование = Справочники.ПодарочныеКарты.СформироватьНаименование(НовКарта);
		НовКарта.СтатусКарты = Перечисления.ПодарочныеКарты_Статус.Создана;
		НовКарта.ДатаСоздания = ТекущаяДата();
		НовКарта.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	Если НомерОт=0 или НомерДо=0 или Номинал.Пустая() Тогда
		ПоказатьПредупреждение(,"Все поля обязательны для заполнения");
		Возврат;
	КонецЕсли;
	СоздатьНаСервере();
КонецПроцедуры
